[

  {
    "name": "C.H.O.M.",
    "filename" : "CHOM",
    "desc": "C.H.O.M. est un jeu vidéo de type Parcours/Shooter dans un environnement sci-fi qui a été réalisé dans Unity avec C# dans le contexte d'un projet étudiant, il a été fait en équipe avec 3 autres étudiants pendant une période de 3 mois. En travaillant de manière agile (SCRUM) et en participant à presque tous les aspects de la conception d'un jeu vidéo, cela m'a permis de gagner de l'expérience et de travailler de manière semblable à l'industrie. Mon équipe et moi avons aussi travaillé en collaboration avec une équipe d'artistes ce qui nous a permis de bien comprendre l'aspect collaboratif de la création de jeux. C.H.O.M. n'était que la première itération de mon aventure dans la création de jeu vidéo et je suis très ambitieux en ce qui concerne mon avenir dans le milieu. Comme vous allez pouvoir le voir ci-dessous bien que ma part dans le projet était axée sur la programmation, j'ai également été grandement impliqué dans le design du jeu.",
    "img": "images/chom.jpg",
    "screenshot" : "images/chom-screenshot.png",
    "status": "done",
    "category" : "École",
    "video": "https://www.youtube.com/embed/JBuz7_cl5_8",
    "download" : "https://queeb99.itch.io/chom",
    "screenshots" : 
    [
      "images/chom-screenshots/Capture d’écran 2023-07-12 225211.png", 
      "images/chom-screenshots/Capture d’écran 2023-07-12 225245.png" ,
      "images/chom-screenshots/Capture d’écran 2023-07-12 225327.png", 
      "images/chom-screenshots/Capture d’écran 2023-07-12 225358.png", 
      "images/chom-screenshots/Capture d’écran 2023-07-12 225632.png", 
      "images/chom-screenshots/Capture d’écran 2023-07-12 225930.png", 
      "images/chom-screenshots/Capture d’écran 2023-07-12 230018.png",
      "200.gif"
    ]
    ,
    "year" : 2022,
    "links" :
    [
      {
        "text": "Guide du jeu",
        "link": "https://docs.google.com/document/d/1V-X_ofIwo_crDE42tgn4gMiNliakSbjkeX7mHsRyLrY/edit?usp=sharing"
      }
    ],
    "contributions": [
      {
        "work": "Programmeur",
        "desc": "Mécaniques de parcours, système d'ennemis et de projectiles, programmation de la majorité des réglages du jeu, système de sélection de niveaux, distributeurs d'armes, vitrines d'inspection dans le lobby et plus encore..."
      },
      {
        "work": "Testeur QA",
        "desc": "Tout au long du projet, j'ai dû faire à répétitions des tests pour m'assurer que les mécaniques fonctionnent bien et qu'ils sont implémentés comme prévu."
      },
      {
        "work": "Game designer",
        "desc": "Du début à la fin du projet j'ai assisté au design du jeu que ce soit pour les niveaux, les mécaniques ou l'environnement."
      }
    ]
  }
]
