[{
  "name": "Subnauticat",
  "filename" : "subnauticat",
  "desc": "Dans ce jeu, tu joues en tant qu'un petit chat explorateur à bord d'un sous-marin qui doit se rendre le plus profond possible sous l'eau. Pour ce faire tu dois aspirer et vendre des trésors pour ensuite acheter des améliorations. Le jeu a été fait dans unity pour le Brackeys Game Jam, thème : Diving Deeper, en une semaine seulement. Je ne connaissais pas très bien les tilemaps de unity avant ce projet donc, j'ai dû faire de la recherche afin de les implémenter.",
  "img": "/images/cover_image.jpg",
  "screenshot" : "/images/subnauticat-screenshots/preview.png",
  "status": "done",
  "category" : "Game jam",
  "download" : "https://queeb99.itch.io/subnauticat",
  "screenshots" : 
  [
    "/images/subnauticat-screenshots/1.png",
    "/images/subnauticat-screenshots/2.png",
    "/images/subnauticat-screenshots/preview.png",
    "/images/subnauticat-screenshots/4.png"
  ]
  ,
  "year" : 2023,
  "length" : "1 semaine",
  "contributions": [
    {
      "work": "Lead Programmeur",
      "desc": "J'ai programmé la majorité des mécaniques du jeu tel que le système d'améliorations, le mouvement et le système de sauvegarde. Le système d'améliorations a été un défi pour moi parce que je n'avais jamais sauvegardé autant de données auparavant."
    },
    {
      "work": "Level Designer",
      "desc": "Dans le projet j'ai dû être level designer. J'ai dû utiliser le tilemap pour créer un environnement intéressant qui pousse le joueur à acheter les améliorations pour aller plus loin."
    }
  ]
},
  {
    "name": "Rest in Pastry",
    "filename" : "rest-in-pastry",
    "desc": "Rest in Pastry est un jeu réalisé en un peu moins de deux semaines pour 'My first game jam'. J'ai eu l'occasion de travailler avec un écrivain, deux artistes et un compositeur de sons tout en programmant le jeu complet par moi-même. Cela m'a donné l'occasion d'apprendre de nouvelles choses et de tester mes capacités.",
    "img": "/images/rip-icon.jpg",
    "status": "done",
    "length" : "2 semaines",
    "category" : "Game jam",
    "download" : "https://queeb99.itch.io/rest-in-pastry",
    "screenshot" : "/images/rip-screenshots/screenshot.png",
    "screenshots" : 
    [
      "/images/rip-screenshots/Capture d’écran 2023-08-08 191842.png",
      "/images/rip-screenshots/screenshot.png",
      "/images/rip-screenshots/Capture d’écran 2023-08-08 192038.png",
      "/images/rip-screenshots/Capture d’écran 2023-08-08 192137.png"
    ]
    ,
    "year" : 2023,
    "contributions": [
      {
        "work": "Programmeur",
        "desc": "J'ai programmé tous les systèmes présents dans le jeu tel que les dialogues, le choix d'objets, servir les fantômes, le système de sauvegarde et plus encore..."
      }

    ]
  },
  {
    "name": "C.H.O.M.",
    "filename" : "CHOM",
    "desc": "C.H.O.M. est un jeu vidéo de type Parcours/Shooter dans un environnement sci-fi qui a été réalisé dans Unity avec C# dans le contexte d'un projet étudiant, il a été fait en équipe avec 3 autres étudiants pendant une période de 3 mois. En travaillant de manière agile (SCRUM) et en participant à presque tous les aspects de la conception d'un jeu vidéo, cela m'a permis de gagner de l'expérience et de travailler de manière semblable à l'industrie. Mon équipe et moi avons aussi travaillé en collaboration avec une équipe d'artistes ce qui nous a permis de bien comprendre l'aspect collaboratif de la création de jeux. C.H.O.M. n'était que la première itération de mon aventure dans la création de jeu vidéo et je suis très ambitieux en ce qui concerne mon avenir dans le milieu. Comme vous allez pouvoir le voir ci-dessous bien que ma part dans le projet était axée sur la programmation, j'ai également été grandement impliqué dans le design du jeu.",
    "img": "/images/chom.jpg",
    "screenshot" : "/images/chom-screenshot.png",
    "length" : "3 mois",
    "status": "done",
    "category" : "École",
    "video": "https://www.youtube.com/embed/JBuz7_cl5_8",
    "download" : "https://queeb99.itch.io/chom",
    "screenshots" : 
    [
      "/images/chom-screenshots/Capture d’écran 2023-07-12 225211.png", 
      "/images/chom-screenshots/Capture d’écran 2023-07-12 225245.png" ,
      "/images/chom-screenshots/Capture d’écran 2023-07-12 225327.png", 
      "/images/chom-screenshots/Capture d’écran 2023-07-12 225358.png", 
      "/images/chom-screenshots/Capture d’écran 2023-07-12 225632.png", 
      "/images/chom-screenshots/Capture d’écran 2023-07-12 225930.png", 
      "/images/chom-screenshots/Capture d’écran 2023-07-12 230018.png"
    ]
    ,
    "year" : 2022,
    "links" :
    [
      {
        "text": "Guide du jeu",
        "link": "https://docs.google.com/document/d/1V-X_ofIwo_crDE42tgn4gMiNliakSbjkeX7mHsRyLrY/edit?usp=sharing"
      }
    ],
    "contributions": [
      {
        "work": "Programmeur",
        "desc": "Mécaniques de parcours, système d'ennemis et de projectiles, programmation de la majorité des réglages du jeu, système de sélection de niveaux, distributeurs d'armes, vitrines d'inspection dans le lobby et plus encore..."
      },
      {
        "work": "Testeur QA",
        "desc": "Tout au long du projet, j'ai dû faire à répétitions des tests pour m'assurer que les mécaniques fonctionnent bien et qu'ils sont implémentés comme prévu."
      },
      {
        "work": "Game Designer",
        "desc": "Du début à la fin du projet j'ai assisté au design du jeu que ce soit pour les niveaux, les mécaniques ou l'environnement."
      }
    ]
  }

]
